<?php
session_start();
require 'vendor/autoload.php';

setlocale(LC_ALL, 'ru_RU.utf8');
Header("Content-Type: text/html;charset=UTF-8");
$host = "localhost";
$user = "root";           
$password = "";
$database = "tester_prof";
$conn = mysqli_connect($host,$user,$password,$database);
mysqli_query ($conn,"SET NAMES utf8");
           $phone = "";
            $password = "";
            if(isset($_POST["phone"])){
              $phone = $_POST["phone"];
              $password = $_POST["password"];
            }        
            elseif (isset($_SESSION['phone'])) {
                $phone = $_SESSION['phone'];
                $password =$_SESSION['password'];
            }
           $phone = "87770886336";
            $password = "dagger21";
            $query = "SELECT * FROM users WHERE  phone = '$phone' and password = '$password'  ";
            $result = mysqli_query($conn,$query);
            while($row=mysqli_fetch_assoc($result)) 
            {
                $product_array1[] = $row;
            }   
           $name =  $product_array1[0]['name'];
           $surname = $product_array1[0]['surname'];
           
           $class = $product_array1[0]['class'];
           $id = $product_array1[0]['phone'];
            $test_1 = $product_array1[0]['test_1'];
            $test_2_1 = $product_array1[0]['first'];
            $test_2_2 = $product_array1[0]['second'];
            $test_2_3 = $product_array1[0]['third'];
            $test_2_4 = $product_array1[0]['fourth'];
            $test_2_5 = $product_array1[0]['fivth'];
            $test_3_1 = $product_array1[0]['1'];
            $test_3_2 = $product_array1[0]['2'];
            $test_3_3 = $product_array1[0]['3'];
            $test_3_4 = $product_array1[0]['4'];
            $test_3_5 = $product_array1[0]['5'];
            $test_3_6 = $product_array1[0]['6'];
            $test_3_7 = $product_array1[0]['7'];
            $test_3_8 = $product_array1[0]['8'];
            $test_3_9 = $product_array1[0]['9'];
            $test_3_10 = $product_array1[0]['10'];
            $test_3_11 = $product_array1[0]['11'];
            $test_3_12 = $product_array1[0]['12'];
            $test_3_13 = $product_array1[0]['13'];
            $test_3_14 = $product_array1[0]['14'];
            $test_3_15 = $product_array1[0]['15'];
            $test_3_16 = $product_array1[0]['16'];
            $test_3_17 = $product_array1[0]['17'];
            $test_3_18 = $product_array1[0]['18'];
            $test_3_19 = $product_array1[0]['19'];
            $test_3_20 = $product_array1[0]['20'];
            $test_3_21 = $product_array1[0]['21'];
            $test_3_22 = $product_array1[0]['22'];
            $test_3_23 = $product_array1[0]['23'];
            $test_3_24 = $product_array1[0]['24'];
            $test_3_25 = $product_array1[0]['25'];
            $test_3_26 = $product_array1[0]['26'];
            $test_3_27 = $product_array1[0]['27'];
            $test_3_28 = $product_array1[0]['28'];
            $test_3_29 = $product_array1[0]['29'];
// Creating the new document...
$phpWord = new \PhpOffice\PhpWord\PhpWord();
$properties = $phpWord->getDocInfo();
$properties->setCreator('My name');
$properties->setCompany('My factory');
$properties->setTitle('My title');
$properties->setDescription('My description');
$properties->setCategory('My category');
$properties->setLastModifiedBy('My name');
$properties->setCreated(mktime(0, 0, 0, 3, 12, 2014));
$properties->setModified(mktime(0, 0, 0, 3, 14, 2014));
$properties->setSubject('My subject');
$properties->setKeywords('my, key, word');
/* Note: any element you append to a document must reside inside of a Section. */

// Adding an empty Section to the document...
$section = $phpWord->addSection();
// Adding Text element to the Section having font styled by default...
$section->addText(
    $name. " " . $surname . "\n" . 
    "Класс: " . $class . "\n" . 
    "ИИН: " . $id . "\n\n" . 
    "                       Тест 1 " . "\n",
    array('name' => 'Tahoma', 'size' => 20)
);

/*
 * Note: it's possible to customize font style of the Text element you add in three ways:
 *" inline;
 *" using named font style (new font style object will be implicitly created);
 *" using explicitly created font style object.
 */

// Adding Text element with font customized inline...
$section->addText(
    $test_1 . "\n\n" .
    "                          Тест 2 " . "\n" .
    "«Человек-природа» " . $test_2_1 . " в диапазоне [-8,8] ". "\n" .
    "«Человек-техника» " . $test_2_2 . " в диапазоне [-8,8] ". "\n" .
    "«Человек-знаковая система» " . $test_2_3 . " в диапазоне [-8,8] ". "\n" .
    "«Человек-искусство» " . $test_2_4 . " в диапазоне [-8,8] ". "\n" .
    "«Человек-человек» " . $test_2_5 . " в диапазоне [-8,8] ". "\n\n" . 
    "                          Тест 3 " . "\n" ,

    array('name' => 'Tahoma', 'size' => 18)
);



$section->addText(
    "Биология: " . $test_3_1 .  " в диапазоне [-12,12]". "\n" .
    "География: " . $test_3_2 . " в диапазоне [-12,12]". "\n" .
    "Геология: "  . $test_3_3 . " в диапазоне [-12,12]". "\n" .
    "Медицина: " . $test_3_4  .  " в диапазоне [-12,12]". "\n" .
    "Легкая и пищевая промышленность: ". $test_3_5 .  " в диапазоне [-12,12]". "\n" .
    "Физика: " . $test_3_6 . " в диапазоне [-12,12]". "\n" .
    "Химия: " . $test_3_7 . " в диапазоне [-12,12]". "\n" .
    "Техника: " . $test_3_8 . " в диапазоне [-12,12]". "\n" .
    "Электро – и  радиотехника: " . $test_3_9 . " в диапазоне [-12,12]". "\n" .
    "Металлообработка: " . $test_3_10 . " в диапазоне [-12,12]". "\n" .
    "Деревообработка: " . $test_3_11 . " в диапазоне [-12,12]". "\n" .
    "Строительство: " .  $test_3_12 . " в диапазоне [-12,12]". "\n" .
    "Транспорт: " . $test_3_13 . " в диапазоне [-12,12]". "\n" .
    "Авиация, морское дело: " . $test_3_14 . " в диапазоне [-12,12]". "\n" .
    "Военные специальности: " . $test_3_15 . " в диапазоне [-12,12]". "\n" .
    "История: " . $test_3_16 . " в диапазоне [-12,12]". "\n" .
    "Литература: " . $test_3_17 . " в диапазоне [-12,12]". "\n" .
    "Журналистика: " . $test_3_18  ." в диапазоне [-12,12]". "\n" .
    "Общественная деятельность: " . $test_3_19 . " в диапазоне [-12,12]". "\n" .
    "Педагогика: " . $test_3_20 . " в диапазоне [-12,12]". "\n" .
    "Право, юриспруденция: " . $test_3_21.  " в диапазоне [-12,12]". "\n" .
    "Сфера обслуживания, торговля: " . $test_3_22 . " в диапазоне [-12,12]". "\n" .
    "Математика: " . $test_3_23 . " в диапазоне [-12,12]". "\n" .
    "Экономика " . $test_3_24 . " в диапазоне [-12,12]". "\n" .
    "Иностранные языки: " . $test_3_25 . " в диапазоне [-12,12]". "\n" .
    "Изобразительное искусство: " . $test_3_26 . " в диапазоне [-12,12]". "\n" .
    "Сценическое искусство: " . $test_3_27 . " в диапазоне [-12,12]". "\n" .
    "Музыка: " . $test_3_28 . " в диапазоне [-12,12]". "\n" .
    "Физкультура и спорт: " . $test_3_29 . " в диапазоне [-12,12]" . "\n",
    array('name' => 'Tahoma', 'size' => 15)
);


$section->addText(
    $test_1 . "\n\n" .
    "                          Информация для 2 теста " . "\n\n" .
    "«Человек-природа» - Представителей этих профессий объединяет одно очень важное качество — любовь к природе. Но любовь не созерцательная. Которой обладают практически все люди, считая природу наиболее благоприятной средой для отдыха, а деятельная связанная с познанием ее законов и применением их. Одно дело — любить животных и растения, играть с ними, радоваться им. И совсем другое — регулярно, день за днем ухаживать за ними, наблюдать, лечить, выгуливать, не считаясь с личным временем и планами. Специалист должен не просто все знать о живых организмах, но и прогнозировать возможные изменения в них и принимать меры. От человека требуется инициатива и самостоятельность в решении конкретных задач, заботливость, терпение и дальновидность. Человек, работающий в сфере «человек-природа», должен быть спокойным и уравновешенным.". "\n\n\n" .
    "«Человек-техника» - Особенность технических объектов в том, что они, как правило, могут быть точно измерены по многим признакам. При их обработке, преобразовании, перемещении или оценке от работника требуется точность, определенность действий. Техника как предмет руда представляет широкие возможности для новаторства, выдумки. творчества, поэтому важное значение приобретает такое качество, как практическое мышление. Техническая фантазия, способность мысленно соединять и разъединять технические объекты и их части — важные условия для успеха в данной области.". "\n\n\n" .
    "«Человек-знаковая система» - Мы встречаемся со знаками значительно чаще, чем обычно представляем себе. Это цифры. Коды, условные знаки, естественные или искусственные языки, чертежи, таблицы формулы. В любом случае человек воспринимает знак как символ реального объекта или явления. Поэтому специалисту, который работает со знаками, важно уметь с одной стороны, абстрагироваться от реальных физических, химически, механических свойств предметов, а с другой — представлять и воспринимать характеристики реальных явлений или объектов, стоящих за знаками. Чтобы успешно работать в какой-нибудь профессии данного типа, необходимо уметь мысленно погружаться в мир, казалось бы, сухих обозначений и сосредотачиваться на сведениях, которые они несут в себе. Особые требования профессии этого типа предъявляют к вниманию.". "\n\n\n" .
    "«Человек-искусство» - Важнейшие требования, которые предъявляют профессии, связанные с изобразительной, музыкальной, литературно-художественной, актерско-сценической деятельностью человека — наличие способности к искусствам, творческое воображение, образное мышление, талант, трудолюбие.". "\n\n\n" .
    "«Человек-человек» - Даже выбирая профессию, не связанную непосредственно с общением, вы поступите правильно, если обратите внимание на общительность и контактность. Подумайте, куда вы обращены- к людям или к себе? С кем бы вы хотели общаться — с собой или с другими? Главное содержание труда в профессиях типа «человек-человек» сводится к взаимодействию между людьми. Если не наладится это взаимодействие, значит, не наладится и работа. Качества, необходимые для работы с людьми: устойчивое, хорошее настроение в процессе работы с людьми, потребность в общении, способность мысленно ставить себя на место другого человека, быстро понимать намерения, помыслы, настроение людей, умение разбираться в человеческих взаимоотношениях, хорошая память (умение держать в уме имена и особенности многих людей), умение находить общий язык с различными людьми, терпение ..." . "\n\n\n" ,
    
    array('name' => 'Tahoma', 'size' => 18)
);

$section->addText(
    "                   Информация для 3 теста
    
Оценка степени выраженности интересов имеет пять градаций: 
— высшая степень отрицания – от –12 до –6 
— интерес отрицается – от –5 до –1 
— интерес выражен слабо – от +1 до +4 
— выраженный интерес – от +5 до +7 
— ярко выраженный интерес – от +8 до +12. 
",
    array('name' => 'Tahoma', 'size' => 18)
);

// Saving the document as OOXML file...
header("Content-Description: File Transfer");
header('Content-Disposition: attachment; filename="ex.docx"');
header('Content-Type: application/vnd.openxmlformats-officedocument.wordprocessingml.document');
header('Content-Transfer-Encoding: binary');
header('Cache-Control: must-revalidate, post-check=0, pre-check=0');
header('Expires: 0');
$xmlWriter = \PhpOffice\PhpWord\IOFactory::createWriter($phpWord, 'Word2007');
$xmlWriter->save("php://output");


?>