<?php
session_start();
if(!isset($_SESSION['enter']) or $_SESSION['enter'] == false)
{
    header("Location:http://localhost/test55/login4.php");
}

?>


<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ru"><head>
<meta http-equiv="Content-Type" content="text/html;charset=UTF-8" /><title></title>

<script type="text/javascript" src="http://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js"></script>
<script type="text/javascript" src="js/jQuizlerKZ.js"></script>
<link rel="stylesheet" href="css/bootstrap/css/bootstrap.min.css" />
<link rel="stylesheet" href="css/jQuizler.css"/>
<script type="text/javascript">
var questions = [
{
type: "choose",
question: "<h3>Сіз өзіңізді көрмеде жүргендей елестетіңіз. Экспонаттарда сізді не көп қызықтырады:</h3>",
answers: [
["түсі, бітімін жетілдіру", "3"],
["олардың ішкі құрылысы (оның қалай және  неден  жасалатыны)", "2"],
],
correct: [1], letter: ["a"] // 1
},
{
type: "choose",
question: "<h3>Адамның қандай мінез-құлқы сізге көбірек ұнайды:</h3>",
answers: [
["достығы, сезімталдығы, өз мүдделерінің болмауы", "0"],
["батылдығы, ерлігі, төзімділігі", "4"]
],
correct: [2], letter: ["b"] // 2
},
{
type: "choose",
question: "<h3>Қызмет мерзімі әртүрлі қызметтермен қамтамасыз етеді. Сізге қажетті деп санайсыз ба?</h3>",
answers: [
["адамдарға толық қызмет ету үшін осы саланы дамытуды жалғастыру", "5"],
["күнделікті өмірде қолдануға болатын техниканы жасау", "2"]
],
correct: [1], letter: ["a"] // 3
},
{
type: "choose",
question: "<h3>Сізді қандай марапат қуантады:</h3>",
answers: [
["қоғамдық қызметіңіз үшін", "0"],
["ғылыми жаңалығыңыз үшін", "1"]
],
correct: [2], letter: ["b"] // 4
},
{
type: "choose",
question: "<h3>Сіз әскери немесе спорттық парад көресіз бе: Сіз  көбіне неге  назар аударасыз:</h3>",
answers: [
["жүру үйлесімділігі", "4"],
["шеру қатысушыларының әсемдігі бағаналардың сыртқы ресімдеуі(тулар, киім және т.б.)", "3"]
],
correct: [1], letter: ["a"] // 5
},
{
type: "choose",
question: "<h3>Сіз өзіңіздің бос уақытыңыз көп деп елестетіңіз,қандай жұмыспен айналысар едіңіз:</h3>",
answers: [
["қандай да бір тәжірибемен (қол еңбегі)", "2"],
["қоғамдық  жұмыспен (ерікті негізде)", "0"]
],
correct: [1], letter: ["a"] // 6
},
{
type: "choose",
question: "<h3>Қандай көрмені сіз үлкен қызығушылықпен тамашалайсыз:</h3>",
answers: [
["жаңа ғылыми аппаратура (физика, химия, биология салаларында)","1"],
["жаңа азық-түлік тауарлар","5"],
],
correct: [2], letter: ["b"] // 7
},
{
type: "choose",
question: "<h3>Егер мектепте екі үйірме болса қайсысын таңдар едіңіз:</h3>",
answers: [
["музыкалық","3"],
["техникалық","2"]
],
correct: [1], letter: ["c"] // 8
},
{
type: "choose",
question: "<h3>Егер сізге мектеп директорының орнын ұсынса, сіз қандай мәселеге  көбірек көңіл бөлер едіңіз:</h3>",
answers: [
["ұжымның ұйымшылдығына","0"],
["жағдайды жақсартуға","5"]
],
correct: [2], letter: ["b"] // 9
},
{
type: "choose",
question: "<h3>Қандай журналдарды сіз үлкен қызығушылықпен оқисыз:</h3>",
answers: [
["көркем-әдеби","3"],
["ғылыми-танымал","1"]
],
correct: [1], letter: ["a"] // 10
},
{
type: "choose",
question: "<h3>Адамға ең маңыздысы не:</h3>",
answers: [
["өзіне ыңғайлы ырыздықты, тұрмыс құру","5"],
["кейбір ыңғайлылықсыз өмір сүру, бірақ көркемдік туындының биік шыңын қолдануға, өнер туындыларына ие болуға  мүмкіндіктері бар","3"]
],
correct: [1], letter: ["a"] // 11
},
{
type: "choose",
question: "<h3>Қоғамның өркендеуі үшін қажет: </h3>",
answers: [
["техника","2"],
["сот төрелігі","0"]
],
correct: [1], letter: ["a"] // 12
},
{
type: "choose",
question: "<h3>Қандай екі кітапты сіз үлкен қызығушылықпен оқыдыңыз:</h3>",
answers: [
["ғылымның дамуы туралы","1"],
["спортшылардың жетістіктері туралы","4"]
],
correct: [1], letter: ["a"] // 13
},
{
type: "choose",
question: "<h3>Газетте екі түрлі мазмұнда мақалалар бар. Олардың қайсысы сізді көбірек қызықтырар еді:</h3>",
answers: [
["машинаның жаңа түрі","2"],
["жаңа ғылыми теория","1"]
],
correct: [1], letter: ["a"] // 14
},
{
type: "choose",
question: "<h3>Ашық ауадағы екі жұмыстың қайсысы сізге көбірек ұнайды:</h3>",
answers: [
["тұрақты қозғалыспен байланысты жұмыс (агроном, орманшы,жол шебері)","4"],
["машиналармен жұмыс","2"]
],
correct: [1], letter: ["a"] // 15
},
{
type: "choose",
question: "<h3>Сіздің көзқарасыңыз бойынша мектептің қандай міндеті неғұрлым маңызды:</h3>",
answers: [
["адамдарға материалдық тауарларды құруға көмектесу үшін адамдармен жұмыс жасауға дайындауға","0"],
["поқушылардың материалдық мүмкіндігін практикалық іс-әрекеттерге дайындау","5"]
],
correct: [1], letter: ["a"] // 16
},
{
type: "choose",
question: "<h3>Сіздің ойыңызша, әуесқой қатысушылардың арасында нені  жоғары бағалау керек:</h3>",
answers: [
["адамдарға өнер мен сұлулықты әкелетіні үшін","3"],
["олардың қоғамдық-пайдалы жұмысты орындағаны үшін","0"]
],
correct: [1], letter: ["a"] // 17
},
{
type: "choose",
question: "<h3>Сіздің ойыңызша, болашақта адамның қай саладағы қызметі басымдыққа ие болады: </h3>",
answers: [
["физика","1"],
["дене шынықтыру","4"]
],
correct: [1], letter: ["a"] // 18
},
{
type: "choose",
question: "<h3>Қоғамға  қайсысы  көп пайда әкеледі:</h3>",
answers: [
["азаматтардың әл-ауқатына қамқорлық","5"],
["адамдардың мінез-құлқын зерттеу","0"]
],
correct: [1], letter: ["a"] // 19
},
{
type: "choose",
question: "<h3>Сіз қандай ғылыми жұмыс сипатын таңдайсыз: </h3>",
answers: [
["кітапханадағы кітаптармен жұмыс істеу","1"],
["экспедицияның таза ауасында жұмыс жасайды","4"]
],
correct: [1], letter: ["a"] // 20
},
{
type: "choose",
question: "<h3>Сіз университеттің профессоры екеніңізді елестетіп көріңіз. Бос уақытыңызда немен  айналысар едіңіз:</h3>",
answers: [
["әдеби сабақтарына","3"],
["физикадағы, химиядағы эксперименттер, тәжірибелер","1"]
],
correct: [1], letter: ["a"] // 21
},
{
type: "choose",
question: "<h3>Сізге әртүрлі елдерге бару мүмкіндігі беріліп тұр:</h3>",
answers: [
["халықаралық жарыстарға атақты спортшы ретінде","4"],
["еліміз үшін қажетті тауарларды сатып алу мақсатында сыртқы сауданың белгілі маманы ретінде","5"]
],
correct: [1], letter: ["a"] // 22
},
{
type: "choose",
question: "<h3>Сіз қандай лекцияларды үлкен қызығушылықпен тыңдар едіңіз:</h3>",
answers: [
["көрнекті суретшілер туралы","3"],
["көрнекті ғалымдар туралы","0"]
],
correct: [1], letter: ["a"] // 23
},
{
type: "choose",
question: "<h3>Кітапты оқығанда сізді не көп қызықтырады:</h3>",
answers: [
["кейіпкерлердің батылдығының жарқын бейнесі","4"],
["тамаша әдеби стиль","3"]
],
correct: [1], letter: ["a"] // 24
},
{
type: "choose",
question: "<h3>Сізде мамандық таңдау мүмкіндігі бар. Олардың қайсысын таңдауға болады:</h3>",
answers: [
["белсенді емес жұмыс, бірақ жаңа технологияларды жасаумен байланысты","2"],
["қозғалысқа байланысты жұмыс","4"]
],
correct: [1], letter: ["a"] // 25
},
{
type: "choose",
question: "<h3>Сізді қандай көрнекті ғалымдар қызықтырады:</h3>",
answers: [
["Попов пен Циолковский","2"],
["Менделеев пен Павлов","1"]
],
correct: [1], letter: ["a"] // 26
},
{
type: "choose",
question: "<h3>Қалай ойлайсыз, мектепте неге неғұрлым көбірек көңіл аудару керек:</h3>",
answers: [
["спорт,денсаулықты нығайту қажет болғандықтан, спортқа","4"],
["студенттердің болашақ дамуына байланысты","5"]
],
correct: [1], letter: ["a"] // 27
},
{
type: "choose",
question: "<h3>Сізді  баспасөздерде  көбіне  не қызықтырар еді:</h3>",
answers: [
["ашылған көркем- көрме туралы хабар","3"],
["адам құқықтарын қорғау жөніндегі митинг туралы жаңалықтар","0"]
],
correct: [1], letter: ["a"] // 28
},
{
type: "choose",
question: "<h3>Егер белгілі бір лауазымға ие болуға мүмкіндігіңіз болса, онда сіз не таңдауыңыз керек:</h3>",
answers: [
["зауыттың бас инженері","5"],
["әмбебап дүкеннің директоры","2"]
],
correct: [1], letter: ["a"] // 29
},
{
type: "choose",
question: "<h3>Сіз қалай ойлайсыз не маңыздырақ:</h3>",
answers: [
["көп білу","1"],
["материалдық әл-ауқатын дамыту","5"]
],
correct: [1], letter: ["a"] // 30
},
];
$("document").ready(function(){
$("#jQuizler").jQuizler(questions);
});
</script>
</head>
<style>
	.langs a{
		padding: 25px;
	}
</style>
<body>
<div id="jQuizler" class="main-quiz-holder">
<h3>Тесттің тақырыбы: "Тест"</h3>
<p><img class="irc_mi" src="https://static6.depositphotos.com/1014550/624/i/450/depositphotos_6240474-stock-photo-test-word-on-keyboard.jpg" alt="Картинки по запросу картинки тест" onload="typeof google==='object'&&google.aft&&google.aft(this)" style="margin-top: 28px;" height="298" width="450" /></p>

<div class="langs" style="padding: 15px;">
	<a href="index.php" class="btn-link">Русский</a>
	<a href="index-kaz.php" class="btn-link">Казахский</a>
</div>
<button class="btn btn-large">Тестті бастау</button> <br />
</div>
</body></html>